use Sjis;

$a = "アソア";
if ($a =~ s/(ア([イソウ])ア)//) {
    if ($1 eq "アソア") {
        if ($2 eq "ソ") {
            print qq{ok - 5 "アソア" =~ s/(ア([イソウ])ア)// \$1=($1), \$2=($2)\n};
        }
        else {
            print qq{not ok - 5 "アソア" =~ s/(ア([イソウ])ア)// \$1=($1), \$2=($2)\n};
        }
    }
    else {
        print qq{not ok - 5 "アソア" =~ s/(ア([イソウ])ア)// \$1=($1), \$2=($2)\n};
    }
}
else {
    print qq{not ok - 5 "アソア" =~ s/(ア([イソウ])ア)// \$1=($1), \$2=($2)\n};
}

__END__
